{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "62000"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "62000"}]}}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62000"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "62000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "62000"}]}}}}, {"name": "StatefulPartitionedCall/multvae_2/encoder/encoder_128/BiasAdd", "op": "_FusedMatMul", "input": ["input_1", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/multvae_2/encoder/encoder_128/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/multvae_2/encoder/encoder_128/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_2/encoder/z_mean/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_2/encoder/encoder_128/Tanh", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/multvae_2/decoder/decoder_128/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_2/encoder/z_mean/BiasAdd", "unknown_5", "unknown_6"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/multvae_2/decoder/decoder_128/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/multvae_2/decoder/decoder_128/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_2/decoder/decoder_output_62000/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_2/decoder/decoder_128/Tanh", "unknown_7", "unknown_8"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/multvae_2/decoder/decoder_output_62000/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of16.bin", "group1-shard2of16.bin", "group1-shard3of16.bin", "group1-shard4of16.bin", "group1-shard5of16.bin", "group1-shard6of16.bin", "group1-shard7of16.bin", "group1-shard8of16.bin", "group1-shard9of16.bin", "group1-shard10of16.bin", "group1-shard11of16.bin", "group1-shard12of16.bin", "group1-shard13of16.bin", "group1-shard14of16.bin", "group1-shard15of16.bin", "group1-shard16of16.bin"], "weights": [{"name": "unknown", "shape": [62000, 128], "dtype": "float32"}, {"name": "unknown_0", "shape": [128], "dtype": "float32"}, {"name": "unknown_1", "shape": [128, 32], "dtype": "float32"}, {"name": "unknown_2", "shape": [32], "dtype": "float32"}, {"name": "unknown_5", "shape": [32, 128], "dtype": "float32"}, {"name": "unknown_6", "shape": [128], "dtype": "float32"}, {"name": "unknown_7", "shape": [128, 62000], "dtype": "float32"}, {"name": "unknown_8", "shape": [62000], "dtype": "float32"}]}]}