{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.1.0", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "62000"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "62000"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/multvae_14/encoder/z_mean/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_14/encoder/z_mean/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_14/encoder/sampling_13/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/multvae_14/encoder/encoder_64/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62000"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_14/encoder/encoder_64/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_14/encoder/z_log_var/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_14/encoder/z_log_var/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_14/decoder/decoder_64/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_14/decoder/decoder_64/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_14/decoder/decoder_output_62000/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "62000"}]}}}}}, {"name": "StatefulPartitionedCall/multvae_14/decoder/decoder_output_62000/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "62000"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_14/encoder/Cast", "op": "Cast", "input": ["input_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/multvae_14/encoder/encoder_64/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/multvae_14/encoder/Cast"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_14/encoder/encoder_64/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_14/encoder/encoder_64/Cast", "StatefulPartitionedCall/multvae_14/encoder/encoder_64/MatMul/ReadVariableOp", "StatefulPartitionedCall/multvae_14/encoder/encoder_64/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/multvae_14/encoder/encoder_64/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/multvae_14/encoder/encoder_64/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_14/encoder/z_mean/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_14/encoder/encoder_64/Tanh", "StatefulPartitionedCall/multvae_14/encoder/z_mean/MatMul/ReadVariableOp", "StatefulPartitionedCall/multvae_14/encoder/z_mean/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_14/encoder/z_log_var/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_14/encoder/encoder_64/Tanh", "StatefulPartitionedCall/multvae_14/encoder/z_log_var/MatMul/ReadVariableOp", "StatefulPartitionedCall/multvae_14/encoder/z_log_var/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/multvae_14/encoder/sampling_13/mul", "op": "Mul", "input": ["StatefulPartitionedCall/multvae_14/encoder/sampling_13/mul/x", "StatefulPartitionedCall/multvae_14/encoder/z_log_var/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_14/encoder/sampling_13/Exp", "op": "Exp", "input": ["StatefulPartitionedCall/multvae_14/encoder/sampling_13/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_14/encoder/sampling_13/add", "op": "AddV2", "input": ["StatefulPartitionedCall/multvae_14/encoder/z_mean/BiasAdd", "StatefulPartitionedCall/multvae_14/encoder/sampling_13/Exp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_14/decoder/decoder_64/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_14/encoder/sampling_13/add", "StatefulPartitionedCall/multvae_14/decoder/decoder_64/MatMul/ReadVariableOp", "StatefulPartitionedCall/multvae_14/decoder/decoder_64/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/multvae_14/decoder/decoder_64/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/multvae_14/decoder/decoder_64/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_14/decoder/decoder_output_62000/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_14/decoder/decoder_64/Tanh", "StatefulPartitionedCall/multvae_14/decoder/decoder_output_62000/MatMul/ReadVariableOp", "StatefulPartitionedCall/multvae_14/decoder/decoder_output_62000/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/multvae_14/decoder/decoder_output_62000/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of8.bin", "group1-shard2of8.bin", "group1-shard3of8.bin", "group1-shard4of8.bin", "group1-shard5of8.bin", "group1-shard6of8.bin", "group1-shard7of8.bin", "group1-shard8of8.bin"], "weights": [{"name": "StatefulPartitionedCall/multvae_14/encoder/z_mean/MatMul/ReadVariableOp", "shape": [64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_14/encoder/z_mean/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_14/encoder/sampling_13/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_14/encoder/encoder_64/MatMul/ReadVariableOp", "shape": [62000, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_14/encoder/encoder_64/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_14/encoder/z_log_var/MatMul/ReadVariableOp", "shape": [64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_14/encoder/z_log_var/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_14/decoder/decoder_64/MatMul/ReadVariableOp", "shape": [32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_14/decoder/decoder_64/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_14/decoder/decoder_output_62000/MatMul/ReadVariableOp", "shape": [64, 62000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_14/decoder/decoder_output_62000/BiasAdd/ReadVariableOp", "shape": [62000], "dtype": "float32"}]}]}