{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "62000"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "62000"}]}}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62000"}, {"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "600"}, {"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "600"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "600"}, {"size": "62000"}]}}}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "62000"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae/encoder/encoder_600/BiasAdd", "op": "_FusedMatMul", "input": ["input_1", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/multvae/encoder/encoder_600/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/multvae/encoder/encoder_600/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae/encoder/z_mean/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae/encoder/encoder_600/Tanh", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae/decoder/decoder_600/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae/encoder/z_mean/BiasAdd", "unknown_5", "unknown_6"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae/decoder/decoder_600/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/multvae/decoder/decoder_600/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae/decoder/decoder_output_62000/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae/decoder/decoder_600/Tanh", "unknown_7", "unknown_8"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/multvae/decoder/decoder_output_62000/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/multvae/decoder/decoder_output_62000/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/multvae/decoder/decoder_output_62000/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of72.bin", "group1-shard2of72.bin", "group1-shard3of72.bin", "group1-shard4of72.bin", "group1-shard5of72.bin", "group1-shard6of72.bin", "group1-shard7of72.bin", "group1-shard8of72.bin", "group1-shard9of72.bin", "group1-shard10of72.bin", "group1-shard11of72.bin", "group1-shard12of72.bin", "group1-shard13of72.bin", "group1-shard14of72.bin", "group1-shard15of72.bin", "group1-shard16of72.bin", "group1-shard17of72.bin", "group1-shard18of72.bin", "group1-shard19of72.bin", "group1-shard20of72.bin", "group1-shard21of72.bin", "group1-shard22of72.bin", "group1-shard23of72.bin", "group1-shard24of72.bin", "group1-shard25of72.bin", "group1-shard26of72.bin", "group1-shard27of72.bin", "group1-shard28of72.bin", "group1-shard29of72.bin", "group1-shard30of72.bin", "group1-shard31of72.bin", "group1-shard32of72.bin", "group1-shard33of72.bin", "group1-shard34of72.bin", "group1-shard35of72.bin", "group1-shard36of72.bin", "group1-shard37of72.bin", "group1-shard38of72.bin", "group1-shard39of72.bin", "group1-shard40of72.bin", "group1-shard41of72.bin", "group1-shard42of72.bin", "group1-shard43of72.bin", "group1-shard44of72.bin", "group1-shard45of72.bin", "group1-shard46of72.bin", "group1-shard47of72.bin", "group1-shard48of72.bin", "group1-shard49of72.bin", "group1-shard50of72.bin", "group1-shard51of72.bin", "group1-shard52of72.bin", "group1-shard53of72.bin", "group1-shard54of72.bin", "group1-shard55of72.bin", "group1-shard56of72.bin", "group1-shard57of72.bin", "group1-shard58of72.bin", "group1-shard59of72.bin", "group1-shard60of72.bin", "group1-shard61of72.bin", "group1-shard62of72.bin", "group1-shard63of72.bin", "group1-shard64of72.bin", "group1-shard65of72.bin", "group1-shard66of72.bin", "group1-shard67of72.bin", "group1-shard68of72.bin", "group1-shard69of72.bin", "group1-shard70of72.bin", "group1-shard71of72.bin", "group1-shard72of72.bin"], "weights": [{"name": "unknown", "shape": [62000, 600], "dtype": "float32"}, {"name": "unknown_0", "shape": [600], "dtype": "float32"}, {"name": "unknown_1", "shape": [600, 200], "dtype": "float32"}, {"name": "unknown_2", "shape": [200], "dtype": "float32"}, {"name": "unknown_5", "shape": [200, 600], "dtype": "float32"}, {"name": "unknown_6", "shape": [600], "dtype": "float32"}, {"name": "unknown_7", "shape": [600, 62000], "dtype": "float32"}, {"name": "unknown_8", "shape": [62000], "dtype": "float32"}]}]}