{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.2.0", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "62000"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "62000"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/multvae_5/encoder/z_mean/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/z_mean/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/sampling_5/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_128/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62000"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_128/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_64/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_64/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_32/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_32/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_16/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_16/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/z_log_var/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/z_log_var/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_16/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_16/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_32/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_32/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_64/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_64/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_128/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_128/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_output_62000/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "62000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_output_62000/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62000"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "62000"}]}}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/Cast", "op": "Cast", "input": ["input_1"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_128/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/multvae_5/encoder/Cast"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_128/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_5/encoder/encoder_128/Cast", "StatefulPartitionedCall/multvae_5/encoder/encoder_128/MatMul/ReadVariableOp", "StatefulPartitionedCall/multvae_5/encoder/encoder_128/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_128/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/multvae_5/encoder/encoder_128/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_64/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_5/encoder/encoder_128/Tanh", "StatefulPartitionedCall/multvae_5/encoder/encoder_64/MatMul/ReadVariableOp", "StatefulPartitionedCall/multvae_5/encoder/encoder_64/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_64/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/multvae_5/encoder/encoder_64/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_32/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_5/encoder/encoder_64/Tanh", "StatefulPartitionedCall/multvae_5/encoder/encoder_32/MatMul/ReadVariableOp", "StatefulPartitionedCall/multvae_5/encoder/encoder_32/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_32/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/multvae_5/encoder/encoder_32/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_16/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_5/encoder/encoder_32/Tanh", "StatefulPartitionedCall/multvae_5/encoder/encoder_16/MatMul/ReadVariableOp", "StatefulPartitionedCall/multvae_5/encoder/encoder_16/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_16/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/multvae_5/encoder/encoder_16/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/z_mean/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_5/encoder/encoder_16/Tanh", "StatefulPartitionedCall/multvae_5/encoder/z_mean/MatMul/ReadVariableOp", "StatefulPartitionedCall/multvae_5/encoder/z_mean/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/z_log_var/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_5/encoder/encoder_16/Tanh", "StatefulPartitionedCall/multvae_5/encoder/z_log_var/MatMul/ReadVariableOp", "StatefulPartitionedCall/multvae_5/encoder/z_log_var/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/sampling_5/mul", "op": "Mul", "input": ["StatefulPartitionedCall/multvae_5/encoder/sampling_5/mul/x", "StatefulPartitionedCall/multvae_5/encoder/z_log_var/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/sampling_5/Exp", "op": "Exp", "input": ["StatefulPartitionedCall/multvae_5/encoder/sampling_5/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/encoder/sampling_5/add", "op": "AddV2", "input": ["StatefulPartitionedCall/multvae_5/encoder/z_mean/BiasAdd", "StatefulPartitionedCall/multvae_5/encoder/sampling_5/Exp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_16/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_5/encoder/sampling_5/add", "StatefulPartitionedCall/multvae_5/decoder/decoder_16/MatMul/ReadVariableOp", "StatefulPartitionedCall/multvae_5/decoder/decoder_16/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_16/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/multvae_5/decoder/decoder_16/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_32/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_5/decoder/decoder_16/Tanh", "StatefulPartitionedCall/multvae_5/decoder/decoder_32/MatMul/ReadVariableOp", "StatefulPartitionedCall/multvae_5/decoder/decoder_32/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_32/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/multvae_5/decoder/decoder_32/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_64/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_5/decoder/decoder_32/Tanh", "StatefulPartitionedCall/multvae_5/decoder/decoder_64/MatMul/ReadVariableOp", "StatefulPartitionedCall/multvae_5/decoder/decoder_64/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_64/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/multvae_5/decoder/decoder_64/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_128/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_5/decoder/decoder_64/Tanh", "StatefulPartitionedCall/multvae_5/decoder/decoder_128/MatMul/ReadVariableOp", "StatefulPartitionedCall/multvae_5/decoder/decoder_128/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_128/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/multvae_5/decoder/decoder_128/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_output_62000/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/multvae_5/decoder/decoder_128/Tanh", "StatefulPartitionedCall/multvae_5/decoder/decoder_output_62000/MatMul/ReadVariableOp", "StatefulPartitionedCall/multvae_5/decoder/decoder_output_62000/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/multvae_5/decoder/decoder_output_62000/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of16.bin", "group1-shard2of16.bin", "group1-shard3of16.bin", "group1-shard4of16.bin", "group1-shard5of16.bin", "group1-shard6of16.bin", "group1-shard7of16.bin", "group1-shard8of16.bin", "group1-shard9of16.bin", "group1-shard10of16.bin", "group1-shard11of16.bin", "group1-shard12of16.bin", "group1-shard13of16.bin", "group1-shard14of16.bin", "group1-shard15of16.bin", "group1-shard16of16.bin"], "weights": [{"name": "StatefulPartitionedCall/multvae_5/encoder/z_mean/MatMul/ReadVariableOp", "shape": [16, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/encoder/z_mean/BiasAdd/ReadVariableOp", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/encoder/sampling_5/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_128/MatMul/ReadVariableOp", "shape": [62000, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_128/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_64/MatMul/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_64/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_32/MatMul/ReadVariableOp", "shape": [64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_32/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_16/MatMul/ReadVariableOp", "shape": [32, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/encoder/encoder_16/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/encoder/z_log_var/MatMul/ReadVariableOp", "shape": [16, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/encoder/z_log_var/BiasAdd/ReadVariableOp", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_16/MatMul/ReadVariableOp", "shape": [8, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_16/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_32/MatMul/ReadVariableOp", "shape": [16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_32/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_64/MatMul/ReadVariableOp", "shape": [32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_64/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_128/MatMul/ReadVariableOp", "shape": [64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_128/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_output_62000/MatMul/ReadVariableOp", "shape": [128, 62000], "dtype": "float32"}, {"name": "StatefulPartitionedCall/multvae_5/decoder/decoder_output_62000/BiasAdd/ReadVariableOp", "shape": [62000], "dtype": "float32"}]}]}